%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% 建立方程组f =  [cos(x(5)),sin(x(5)),1]*Kx*[x(2);x(3);x(4);1];

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% INPUT
% x        :  - 待求量x(1) = Tdy; x(2)=p_e_x;  x(3)=p_e_z;  x(4)=p_e_y;  x(5) = thetaz ;
% K        :  - 由fenli_1函数结果所组成的系数矩阵（不包含Tdy）
% k        :  - Tdy系数矩阵
% n        :  - 方程组个数 n=3*size(P); size(P)为点的个数

% OUTPUT
% f        :  - 待用fsolve求解的方程组
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
function f=myfun_1(x,K,k,n)

Kn =[]; 
for i = 1:n
    Kx = K(:,:,i);
    Kx(3,4) = k(i)*x(1) + Kx(3,4);
    Kwi = [cos(x(5)),sin(x(5)),1]*Kx;
    Kn = [Kn;Kwi];
end

 f= Kn*[x(2);x(3);x(4);1];

end     
